# Əvvəlcə math modulunu import edirik.
# Əks halda onun imkanlarından yararlana bilməyəcəyik
import math

# math.ceil(x) - kəsr ədədini yuxarıya doğru yuvarlaqlaşdırma
# ====================================================
x = 12.1
# ====================================================

# math.ceil(x) funksiyasını özünüz yazmağa çalışın
# ====================================================

# =====================================================

# math.floor(x) - kəsr ədədini aşağıya doğru yuvarlaqlaşdırır
# ====================================================
x = 12.1
# ====================================================

# math.floor(x) funksiyasını özünüz yazmağa çalışın
# ====================================================

# ====================================================

# math.fabs(x) - ədədin müsbət dəyərini qaytarır
# ====================================================
x = -12.1
# ====================================================

# math.fabs(x) funksiyasını özünüz yazmağa çalışın
# ====================================================

# ====================================================

# math.isclose(a, b, rel_tol) - ədədlərin yaxınlığını hesablayır
# ====================================================

# ====================================================

# math.isclose(a, b, rel_tol) funksiyasını özünüz yazmağa çalışın
# ====================================================

# ====================================================