# istifadəçinin doğulduğu ili soruşun və neçə yaşda olduğunu hesablayıb print edin
# ==============================================

# ==============================================

# 2022-ci ildə neçə yaşı olacaq?
# ==============================================

# ==============================================

# istifadəçinin yaşının kubunu tapın
# ==============================================

# ==============================================

# 0-dan 100-ə qədər olan bütün cüt rəqəmləri print edin
# ==============================================

# ==============================================

# 1-dən 100-ə qədər bütün 3-ə və 5-ə bölünən ədədlərin cəmini tapın (terner operatoru istifadə etməklə)
# ==============================================

# ==============================================

# iki rəqəmin ən böyük ortaq bölünənini tapın
# ==============================================

# ==============================================